Revit 2024 API
IFCExternalServiceUIData.IsReset Property
 flag to indicate the value has been reset
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsReset { get; set; }
Visual Basic
Public Property IsReset As Boolean
	Get
	Set
Visual C++
public:
property bool IsReset {
	bool get ();
	void set (bool value);
}
See Also
IFCExternalServiceUIData Class
Autodesk.Revit.UI Namespace